---
kind: property
id: P:Autodesk.Revit.DB.NestedFamilyTypeReference.FamilyName
source: html/6a7374ea-c6ff-6f53-f5ee-a72ada1bf6a6.htm
---
# Autodesk.Revit.DB.NestedFamilyTypeReference.FamilyName Property

Name of the referenced family

## Syntax (C#)
```csharp
public string FamilyName { get; }
```